/**
 *******************************************************************************
 * @author  guzi
 * @date    2026-09-13
 * @brief   模块功能简介
 *
 * @par 主要功能
 * - 功能一
 * - 功能二
 * - 功能三
 *
 * @note 使用注意事项
 * - 1 tab == 4 spaces
 *******************************************************************************
 */
 
 /**
 * @brief  一句话说明函数做什么
 * @param  参数的含义
 * @return 返回值的含义
 * @note   阻塞、调用条件或者注意事项
 */
 
示例如下：

 /**
 * @brief  返回按键是否按下的状态
 * @param  无
 * @return key_press_state_t:
				KEY_NOT_PRESS 	按键未按下
				KEY_PRESS		按键按下
 * @note   本函数进行单次检测，不含消抖
 */
key_press_state_t key_scan(void)
{
    if (GPIO_PIN_RESET == HAL_GPIO_ReadPin(KEY_GPIO_Port, KEY_Pin))
    {
        return KEY_PRESS;
    }
    return KEY_NOT_PRESS;
}
 
 
 头文件
/*============================== Includes ====================================*/
 
 
/*============================ End of Includes ===============================*/


类型定义
/*========================== Type Definitions ================================*/


/*======================== End of Type Definitions ===========================*/


函数定义
/*======================== Function Declarations =============================*/


/*====================== End of Function Declarations ========================*/

